app/controllers/admin/announcements_controller.rb

SELECT COUNT(*) FROM `announcements`
SELECT `announcements`.* FROM `announcements` ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    @jobs = Announcement.order_ct_desc.page(params[:page]).per(10)

INSERT INTO `announcements` (`created_at`, `title`, `updated_at`) VALUES ('2014-08-18 07:56:03', 'nihaoasdf asdf sadf sadf ', '2014-08-18 07:56:03')
---
  def create
    @job = Announcement.new(
        :title => params[:announcement][:title]
    )
    if @job.save

SELECT `announcements`.* FROM `announcements` WHERE `announcements`.`id` = 1 LIMIT 1
---
  def edit
    @job = Announcement.find(params[:id])

SELECT `announcements`.* FROM `announcements` WHERE `announcements`.`id` = 1 LIMIT 1
UPDATE `announcements` SET `title` = 'aaa', `updated_at` = '2014-08-18 08:10:36' WHERE `announcements`.`id` = 1
---
  def update
    @category = Announcement.find(params[:id])
    update_category = @category.update_attributes(
        :title => params[:announcement][:title]
    )

SELECT `announcements`.* FROM `announcements` WHERE `announcements`.`id` = 1 LIMIT 1
---
  def show
    @job = Announcement.find params[:id]

SELECT `announcements`.* FROM `announcements` WHERE `announcements`.`id` = 3 LIMIT 1
DELETE FROM `announcements` WHERE `announcements`.`id` = 3
---
  def destroy
    @job = Announcement.find(params[:id])
    flash[:error_msg] = @job.destroy ? "删除成功" : "请稍后再试"