app/controllers/admin/gangaos_controller.rb

SELECT COUNT(*) FROM `gangaos`
SELECT `gangaos`.* FROM `gangaos` ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    @gangaos = Gangao.order_ct_desc.page(params[:page]).per(10)

INSERT INTO `gangaos` (`avatar1_content_type`, `avatar1_file_name`, `avatar1_file_size`, `avatar1_updated_at`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `description`, `feiyongshuoming`, `price`, `title`, `updated_at`, `wenxintishi`, `xingcheng`, `yudingtishi`) VALUES ('image/jpeg', '20140818Aug0814083707877614.jpg', 27801, '2014-08-18 14:06:27', 'image/jpeg', '20140818Aug08140837078740236.jpg', 128517, '2014-08-18 14:06:27', '2014-08-18 14:06:27', 'asdf', '<p>请填写费用说明......</p>\r\n', 0, 'adsf', '2014-08-18 14:06:27', '<p>请填写温馨提示......</p>\r\n', '<p>请填写参考行程......</p>\r\n', '<p>请填写预订提示......</p>\r\n')
---
  def create
    if request.post?
      if params[:gangao]
        avatar = params[:gangao][:avatar]
        avatar1 = params[:gangao][:avatar1]
        title = params[:gangao][:title]
        description = params[:gangao][:description]
        price = params[:gangao][:price]
        xingcheng = params[:gangao][:xingcheng]
        feiyongshuoming = params[:gangao][:feiyongshuoming]
        wenxintishi = params[:gangao][:wenxintishi]
        yudingtishi = params[:gangao][:yudingtishi]
        imagename = avatar.original_filename
        avatar.original_filename = Time.now.strftime("%Y%m%d%h%m%s")<<rand(99999).to_s<<imagename[imagename.length-4, 4]

SELECT `gangaos`.* FROM `gangaos` WHERE `gangaos`.`id` = 2 LIMIT 1
---
  def show
    @hotline = Gangao.find params[:id]

SELECT `gangaos`.* FROM `gangaos` WHERE `gangaos`.`id` = 1 LIMIT 1
DELETE FROM `gangaos` WHERE `gangaos`.`id` = 1
---
  def destroy
    @gangao = Gangao.find(params[:id])
    @gangao.destroy